### **Ejercicio 1: Limpiar y transformar columnas de texto**
Dado el siguiente DataFrame de productos:

In [88]:
import pandas as pd

data = {
    'Producto': ['Café', 'té', ' chocolate', ' Cacao '],
    'Precio': [100, 80, 150, 120],
    'Categoría': ['bebidas calientes', 'bebidas calientes', 'snacks dulces', ' bebidas calientes ']
}

df_productos = pd.DataFrame(data)

df_productos

     Producto  Precio            Categoría
0        Café     100    bebidas calientes
1          té      80    bebidas calientes
2   chocolate     150        snacks dulces
3      Cacao      120   bebidas calientes

1. Elimina los espacios en blanco de las columnas **Producto**.
2. Convierte todos los valores de la columna **Categoría** a mayúsculas.
3. Reemplaza la categoría 'snacks dulces' por 'postres'.
4. Crea una nueva columna que indique si el precio es mayor o igual a 120. Usa una función `lambda` para esto.

In [89]:
import pandas as pd

# Eliminar los espacios al principio y al final
df_productos['sin_es'] = df_productos['Producto'].str.strip()

print(df_productos)

     Producto  Precio            Categoría     sin_es
0        Café     100    bebidas calientes       Café
1          té      80    bebidas calientes         té
2   chocolate     150        snacks dulces  chocolate
3      Cacao      120   bebidas calientes       Cacao

In [90]:
df_productos['Categoría']= df_productos['Categoría'].str.upper()

print(df_productos)

     Producto  Precio            Categoría     sin_es
0        Café     100    BEBIDAS CALIENTES       Café
1          té      80    BEBIDAS CALIENTES         té
2   chocolate     150        SNACKS DULCES  chocolate
3      Cacao      120   BEBIDAS CALIENTES       Cacao

In [91]:
df_productos= df_productos.replace('SNACKS DULCES','POSTRES')
print(df_productos)

     Producto  Precio            Categoría     sin_es
0        Café     100    BEBIDAS CALIENTES       Café
1          té      80    BEBIDAS CALIENTES         té
2   chocolate     150              POSTRES  chocolate
3      Cacao      120   BEBIDAS CALIENTES       Cacao

In [92]:
df_productos['mayor120']=df_productos['Precio'].apply(lambda x: x>=120)
df_productos

     Producto  Precio            Categoría     sin_es  mayor120
0        Café     100    BEBIDAS CALIENTES       Café     False
1          té      80    BEBIDAS CALIENTES         té     False
2   chocolate     150              POSTRES  chocolate      True
3      Cacao      120   BEBIDAS CALIENTES       Cacao      True

### **Ejercicio 2: Limpieza de duplicados y manejo de datos faltantes**
Dado el siguiente DataFrame de empleados:

In [93]:
data_empleados = {
    'Nombre': ['Ana', 'Luis', 'Pedro', 'Luis', 'Juan', 'Ana'],
    'Edad': [29, 45, None, 40, 35, 29],
    'Departamento': ['Ventas', 'Finanzas', 'RRHH', 'Finanzas', 'Marketing', None]
}

df_empleados = pd.DataFrame(data_empleados)

df_empleados

  Nombre  Edad Departamento
0    Ana  29.0       Ventas
1   Luis  45.0     Finanzas
2  Pedro   NaN         RRHH
3   Luis  40.0     Finanzas
4   Juan  35.0    Marketing
5    Ana  29.0         None

1. Elimina las filas duplicadas en base a la columna **Nombre**. Quédate con la persona `más joven´.
2. Llena los valores faltantes de la columna **Edad** con la media de las edades.
3. Llena los valores faltantes de la columna **Departamento** con el valor 'Desconocido'.
4. Ordena el DataFrame por edad de forma descendente.

In [94]:
import pandas as pd
df_duplicados=df_empleados.sort_values(by=['Nombre','Edad'])
df_sin_duplicados =df_duplicados.drop_duplicates(subset='Nombre', keep='first')

print(df_sin_duplicados)

  Nombre  Edad Departamento
0    Ana  29.0       Ventas
4   Juan  35.0    Marketing
3   Luis  40.0     Finanzas
2  Pedro   NaN         RRHH

In [95]:
df_sin_duplicados['Edad'] = df_sin_duplicados['Edad'].fillna(df_sin_duplicados['Edad'].mean())

print(df_sin_duplicados)

  Nombre       Edad Departamento
0    Ana  29.000000       Ventas
4   Juan  35.000000    Marketing
3   Luis  40.000000     Finanzas
2  Pedro  34.666667         RRHH

/var/folders/wc/t36cttgx18d9v12fs7c9bgm80000gn/T/ipykernel_3903/2353169484.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df_sin_duplicados['Edad'] = df_sin_duplicados['Edad'].fillna(df_sin_duplicados['Edad'].mean())

In [96]:
df_empleados['Departamento'] = df_empleados['Departamento'].fillna('Desconocido')

print(df_empleados)

  Nombre  Edad Departamento
0    Ana  29.0       Ventas
1   Luis  45.0     Finanzas
2  Pedro   NaN         RRHH
3   Luis  40.0     Finanzas
4   Juan  35.0    Marketing
5    Ana  29.0  Desconocido

In [97]:
df_sin_duplicados=df_sin_duplicados.sort_values(by=['Edad'],ascending=False)
print(df_sin_duplicados)

  Nombre       Edad Departamento
3   Luis  40.000000     Finanzas
4   Juan  35.000000    Marketing
2  Pedro  34.666667         RRHH
0    Ana  29.000000       Ventas

### **Ejercicio 3: Aplicar funciones a las columnas**
Dado un DataFrame de ventas de productos:

In [98]:
data_ventas = {
    'Producto': ['Café', 'Té', 'Jugo', 'Agua'],
    'Precio': [120, 80, 90, 60],
    'Cantidad': [3, 5, 2, 8]
}

df_ventas = pd.DataFrame(data_ventas)
df_ventas

  Producto  Precio  Cantidad
0     Café     120         3
1       Té      80         5
2     Jugo      90         2
3     Agua      60         8

1. Calcula el total de ventas (Precio * Cantidad) y agrégalo como una nueva columna.
2. Crea una nueva columna llamada **Descuento** que aplique un descuento del 10% si el precio es mayor a 100, y del 5% si es menor o igual a 100. Usa la función `apply` y una función `lambda`.

In [99]:
df_ventas['total_de_ventas']= df_ventas['Precio'] * df_ventas['Cantidad']

df_ventas

  Producto  Precio  Cantidad  total_de_ventas
0     Café     120         3              360
1       Té      80         5              400
2     Jugo      90         2              180
3     Agua      60         8              480

In [100]:
df_ventas['Descuento'] = df_ventas['Precio'].apply(lambda x: 0.10 if x > 100 else 0.05)

df_ventas

  Producto  Precio  Cantidad  total_de_ventas  Descuento
0     Café     120         3              360       0.10
1       Té      80         5              400       0.05
2     Jugo      90         2              180       0.05
3     Agua      60         8              480       0.05

### **Ejercicio 4: Uso de funciones de cadena**
Dado el siguiente DataFrame de direcciones de clientes:

In [101]:
data_clientes = {
    'Cliente': ['Juan Pérez', 'Ana Ruiz', 'Pedro López'],
    'Dirección': ['calle falsa 123', 'Calle PRINCIPAL 45', 'AV. LOS robles 34']
}

df_clientes = pd.DataFrame(data_clientes)
df_clientes

       Cliente           Dirección
0   Juan Pérez     calle falsa 123
1     Ana Ruiz  Calle PRINCIPAL 45
2  Pedro López   AV. LOS robles 34

1. Convierte todos los valores de la columna **Dirección** a minúsculas.
2. Reemplaza las abreviaturas "calle", "av." por "calle" y "avenida" respectivamente.
3. Extrae el número de la dirección y guárdalo en una nueva columna llamada **Número**.

In [102]:
df_clientes['Dirección']= df_clientes['Dirección'].str.lower()

print(df_clientes)

       Cliente           Dirección
0   Juan Pérez     calle falsa 123
1     Ana Ruiz  calle principal 45
2  Pedro López   av. los robles 34

In [103]:
df_clientes['Dirección'] = df_clientes['Dirección'].str.replace('calle', 'Calle', regex=True)
df_clientes['Dirección'] = df_clientes['Dirección'].str.replace('av.', 'Avenida', regex=True)

print(df_clientes)

       Cliente              Dirección
0   Juan Pérez        Calle falsa 123
1     Ana Ruiz     Calle principal 45
2  Pedro López  Avenida los robles 34

In [107]:
df_clientes['Número'] = df_clientes['Dirección'].str.extract(r'(\d+)')

# Mostrar el DataFrame actualizado
print(df_clientes)

       Cliente              Dirección Número
0   Juan Pérez        Calle falsa 123    123
1     Ana Ruiz     Calle principal 45     45
2  Pedro López  Avenida los robles 34     34